Tekla Open API Reference for Tekla Structures 2025
IHasChildren.GetObjects Method
Overload List
Name | Description
GetObjects()
 Gets the children of the current object.
GetObjects(Type[])
 Gets the children of the current object that are of certain types.
Top
See Also
Reference
IHasChildren Interface
Tekla.Structures.Drawing Namespace